package util

class DateTimeUtilSpec extends spock.lang.Specification {
	def "calcMinutesで何分の差があるか計算できる"(){
		expect:
		DateTimeUtil.calcMinutes(from, to) == expected
		
		where:
		from				|to					|expected
		"2014/10/12 09:00"	|"2014/10/12 18:00"	|9 * 60
		"2014/10/12 00:00"	|"2014/10/12 24:00"	|24 * 60
		"2014/10/12 00:00"	|"2014/10/12 25:00"	|25 * 60
		"2014/10/12 09:00"	|"2014/10/13 09:00"	|24 * 60
		"2014/10/13 09:00"	|"2014/10/12 09:00"	|-24 * 60
		"2012/02/28 09:00"	|"2012/03/01 09:00"	|48 * 60 // うるう年
		"2014/02/28 09:00"	|"2014/03/01 09:00"	|24 * 60
	}
}